In [2]:
pip install pandas

Note: you may need to restart the kernel to use updated packages.
Collecting pandas
  Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\python310\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.1-cp310-cp310-win_amd64.whl (11.6 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.1

[notice] A new release of pip is available: 23.3.2 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
data = {'שם': ['אלישבע', 'בת שבע', 'גילה'],
        'ממוצע': [25, 32, 18],
        'כיתה': ['יא', 'יב', 'יא']}

In [5]:
sample = pd.DataFrame(data)

In [6]:
sample

       שם  ממוצע כיתה
0  אלישבע     25   יא
1  בת שבע     32   יב
2    גילה     18   יא

In [14]:
sample['שם']

0    אלישבע
1    בת שבע
2      גילה
Name: שם, dtype: object

In [21]:
sample[sample['כיתה'] == 'יא']

       שם  ממוצע כיתה
0  אלישבע     25   יא
2    גילה     18   יא

In [17]:
sample['ממוצע'].max()

32

In [22]:
sample.loc[len(sample.index)] = ['leah', 89, 'יד']

In [23]:
sample

       שם  ממוצע כיתה
0  אלישבע     25   יא
1  בת שבע     32   יב
2    גילה     18   יא
3    leah     89   יד

In [56]:
df = pd.read_csv('cities.csv')

In [57]:
df

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""",State
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [27]:
df.isnull().sum().sum()

0

In [42]:
df['LatD'] = df.LatD.fillna(0)

In [44]:
df['LatD'].mean()

38.8203125

In [45]:

df['LatD'].min()

26

In [46]:
df['LatD'].max()

50

In [60]:
df.rename(columns={'State': 'model'}, inplace=True)

In [61]:
df

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""",State
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

TypeError: 'Series' object is not callable

KeyError: '"LatM"'